/**
 * Created by vic on 2017/6/17.
 */
'use strict';

module.exports = {
  Email: '邮箱',
};

// 管理员错误返回提示
module.exports = {
  2001: '创建管理员账户失败',
  2002: '修改管理员信息失败',
  2003: '创建管理员角色失败',
  2004: '修改管理员角色失败',
  2005: '删除管理员角色失败',
  2006: '创建子账户失败',
  2007: '修改子账户失败',
  2008: '删除子账户失败',
  2009: '添加权限组失败',
  2010: '修改权限组失败',
  2011: '删除权限组失败',
  2012: '添加权限失败',
  2013: '修改权限失败',
  2014: '删除权限失败',
  2015: '登录失败',
  2016: '用户未登录',
};

// 用户级别错误返回
module.exports = {
  6001: '手机号已注册',
  6002: '创建用户失败',
  6003: '无效手机号',
  6004: '用户不存在或者密码错误',
  6005: '用户未登录',
  6006: '更新用户信息失败',
  6007: '更新图片失败',
};
